// 27 Определить количество цифр в числе
Console.WriteLine("Введите число = ");
string num = Console.ReadLine();
Console.WriteLine("Количество цифр в числе = " + num.Length);