//0. Вывести квадрат числа
Console.WriteLine("Введите число: ");
int numer1 = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Квадрат числа = " + numer1 * numer1);