// 33. Задать массив из 12 элементов, заполненных числами из [0,9]. 
//Найти сумму положительных/отрицательных элементов массива

int[] mass = { 1, 3, 6, 0, 4, 8, 9, 0 };
Console.WriteLine(mass);
Console.WriteLine(mass[2]);

Console.WriteLine("Введите ваше имя ");
string user = Console.ReadLine();
Console.WriteLine(user);
Console.WriteLine(user[2]);